//
//  Location.swift
//  SNUYum
//
//  Created by SEONG YEOL YI on 2021/04/07.
//

import Foundation

extension Restaurant {
    var location: (latitude: Double, longitude: Double)? {
        coordRaw[id]
    }
    var locationDescription: String? {
        coordDescription[id]
    }
}

private let coordRaw: [RestaurantID : (latitude: Double, longitude: Double)] = [
    .학생회관: (37.459225, 126.950646),
    .자하연: (37.460897, 126.952533),
    .예술계: (37.461870, 126.953100),
    .두레미담: (37.456387, 126.948524),
    .동원관: (37.464997, 126.951686),
    .기숙사: (37.463120, 126.958669),
    .공대간이: (37.457240, 126.950824),
    .삼: (37.456387, 126.948524),
    .삼백이: (37.448743, 126.952539),
    .삼백일: (37.449987, 126.952483),
    .이백이십: (37.464518, 126.954264),
    .소담마루: (37.465035, 126.951673),
    .라운지오: (37.465035, 126.951673),
    .아워홈: (37.462050, 126.957779),
    .구백십구: (37.463436, 126.958442)
]

var coordDescription: [RestaurantID: String] = [
    .학생회관: "63동[학생회관] 지상1층/지하1층(점심)",
    .자하연: "109동[자하연식당] 지상2층/지상3층(교직원)",
    .예술계: "74동[예술복합연구동] 지상1층",
    .두레미담: "75-1동[제3학생식당] 지상5층",
    .동원관: "113동[동원생활관] 지상2층",
    .기숙사: "919동[학생생활관] 지상1층",
    .공대간이: "30-2동[공대간이식당] 지상1층",
    .삼: "75-1동[제3학생식당] 지상3층/4층",
    .삼백이: "302동[신공학관2] 지상1층",
    .삼백일: "301동[신공학관1] 지상1층(교직원)/지하1층 ",
    .이백이십: "220동[종합교육연구동] 지하1층",
    .소담마루: "113동[동원생활관] 지상3층",
    .라운지오: "113동[동원생활관] 지상1층",
    .아워홈: "901동[학생생활관] 지상1층",
    .구백십구: "919A동 지하 1층"
]
